from func import *  # Импортируем функции из файла func.py

print("________________________________\n|    Телефонный справочник     |\n|______________________________|\n")

while True:
    # Выводим меню с вариантами действий
    print("Выберите действие:\n1) Добавление контакта;\n2) Вывод контактов;\n3) Поиск по фамилии;\n4) Изменение контакта;\n5) Удаление контакта;\n6) Выход.\n")
    choise_number = int(input("Ваш выбор: "))  # Получаем выбор пользователя
    
    if choise_number in [1, 2, 3, 4, 5, 6]:  # Проверяем, что выбор валиден
        counter = choise(choise_number)  # Вызываем функцию choise для выполнения выбранного действия
        print("________________________________")  # Разделитель для читабельности
        if counter == 1:
            break  # Если пользователь выбрал "Выход", завершаем цикл
    else:
        print("Некорректный ввод. Попробуйте снова.")
